RhinoInside.Revit API Documentation
GeometryDecoder.ToBrep Method (Face)
 Converts the specified Autodesk.Revit.DB.Face to an equivalent Rhino.Geometry.Brep.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Rhino.Geometry.Brep ToBrep(
	this Autodesk.Revit.DB.Face face
)
@staticmethod
def ToBrep(
	face: Autodesk.Revit.DB.Face
) -> Rhino.Geometry.Brep
Parameters
face
Type: Autodesk.Revit.DB.Face
Revit face to convert.
Return Value
Type: Rhino.Geometry.Brep
Rhino brep that is equivalent to the provided Revit face.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.Face. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToBrep(Face) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Brep rhinoBrep = revitFace.ToBrep();
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
rhino_brep = revit_face.ToBrep() # type: RG.Brep
 Using ToBrep(Face) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Brep rhinoBrep = GeometryEncoder.ToBrep(revitFace)
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryDecoder as GD
rhino_brep = GD.ToBrep(revit_face) # type: RG.Brep
See Also
Reference
GeometryDecoder Class
ToBrep Overload
RhinoInside.Revit.Convert.Geometry Namespace